#include "stdio.h"
#include "unistd.h"

void welcome() {

    char row1[] = "      ___    ___           ___   _  _    ___    _      _      ㅤ  ∧＿∧";
    char row2[] = "     |_ _|  / __|         / __| | || |  | __|  | |    | |     　(　･∀･)";
    char row3[] = "      | |  | (__          \\__ \\ | __ |  | _|   | |__  | |__   　(　つ┳⊃";
    char row4[] = "     |___|  \\___|         |___/ |_||_|  |___|  |____| |____|    (_)へ⌒ヽﾌ";
    char row5[] = "    |\"\"\"\"\"_|\"\"\"\"\"_|\"\"\"\"\"_|\"\"\"\"\"_|\"\"\"\"\"_|\"\"\"\"\"_|\"\"\"\"\"_|\"\"\"\"\"|___(　　(　･ω･)";
    char row6[] = "    '-0-0-\"`-0-0-\"`-0-0-\"`-0-0-\"`-0-0-\"`-0-0-\"`-0-0-\"`-0-0-'   ◎―◎   ⊃  ⊃";

   for (int i = 0; i < 4; ++i) {
        printf("%s\n", &row1[76-3*i]);
        printf("%s\n", &row2[75-3*i]);
        printf("%s\n", &row3[75-3*i]);
        printf("%s\n", &row4[76-3*i]);
        printf("%s\n", &row5[77-(i == 3? 10:3*i)]);
        printf("%s\n", &row6[75-3*i]);
        printf("\033[A\033[A\033[A\033[A\033[A\033[A\r");
        usleep(100*1000);
    }
    printf("%s\n", &row1[62]);
    printf("%s\n", &row2[62]);
    printf("%s\n", &row3[62]);
    printf("%s\n", &row4[62]);
    printf("%s\n", &row5[62]);
    printf("%s\n", &row6[62]);
    printf("\033[A\033[A\033[A\033[A\033[A\033[A\r");
    usleep(500*1000);
    printf("ㅤ ∧＿＿∧\n　( ･∀ ･ )\n　(　つ┳⊃\nε (_)へ⌒ヽﾌ\n (　　(　･ω･)\n ◎―◎   ⊃  ⊃\n");
    printf("\033[A\033[A\033[A\033[A\033[A\033[A\r");
    usleep(250*1000);
    printf("ㅤ ∧＿＿∧\n　( ･∀ ･ )\n　(　つ┳つ\nε (_)へ⌒ヽﾌ\n (　　(　･ω･)\n ◎―◎   ⊃  ⊃\n");
    printf("\033[A\033[A\033[A\033[A\033[A\033[A\r");
    usleep(250*1000);
    printf("ㅤ ∧＿＿∧\n　( ･∀ ･ )\n　(　つ┳ა\nε (_)へ⌒ヽﾌ\n (　　(　･ω･)\n ◎―◎   ⊃  ⊃\n");
    printf("\033[A\033[A\033[A\033[A\033[A\033[A\r");
    usleep(250*1000);
    printf("ㅤ ∧＿＿∧\n　( ･∀ ･ )\n　(　つ┳つ\nε (_)へ⌒ヽﾌ\n (　　(　･ω･)\n ◎―◎   ⊃  ⊃\n");
    printf("\033[A\033[A\033[A\033[A\033[A\033[A\r");
    usleep(250*1000);
    printf("ㅤ ∧＿＿∧\n　( ･∀ ･ )\n　(　つ┳ა\nε (_)へ⌒ヽﾌ\n (　　(　･ω･)\n ◎―◎   ⊃  ⊃\n");
    printf("\033[A\033[A\033[A\033[A\033[A\033[A\r");
    usleep(250*1000);
    printf("ㅤ  ∧＿∧  \n　(　･∀･)  \n　(　つ┳⊃\nε (_)へ⌒ヽﾌ\n (　　(　･ω･)\n ◎―◎   ⊃  ⊃\n");
    usleep(250*1000);

    for (int i = 59; i >= 0; --i) {
        printf("\033[A\033[A\033[A\033[A\033[A\033[A\r");
        printf("%s\n", &row1[i]);
        printf("%s\n", &row2[i]);
        printf("%s\n", &row3[i]);
        printf("%s\n", &row4[i]);
        printf("%s\n", &row5[i]);
        printf("%s\n", &row6[i]);
        usleep(50*1000);
    }
    printf("\n");
}